app/controllers/servicerequests_controller.rb

    def book
        @user = Current.user.id
        # puts(@user)
        # puts(params[:id])
        servicerequest = Servicerequest.create(user_id: @user, vehicle_id: params[:id], status: "Pending", service_date: params[:servicerequest][:service_date])
---
INSERT INTO "servicerequests" ("status", "user_id", "vehicle_id", "created_at", "updated_at", "service_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["status", "Pending"], ["user_id", 4], ["vehicle_id", 10], ["created_at", "2023-04-21 05:15:00.180939"], ["updated_at", "2023-04-21 05:15:00.180939"], ["service_date", "2023-04-19"]]

    def destroy
        @service = Servicerequest.find(params[:id])
        @service.destroy
---
SELECT "servicerequests".* FROM "servicerequests" WHERE "servicerequests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "servicerequests" WHERE "servicerequests"."id" = $1  [["id", 2]]

    def booked
        @service_records = Servicerequest.joins(:vehicle).where("vehicles.user_id = ?", Current.user.id)

        if @service_records.any?
            @service_records.each do |service|
---
SELECT "servicerequests".* FROM "servicerequests" INNER JOIN "vehicles" ON "vehicles"."id" = "servicerequests"."vehicle_id" WHERE (vehicles.user_id = 4)
SELECT 1 AS one FROM "servicerequests" INNER JOIN "vehicles" ON "vehicles"."id" = "servicerequests"."vehicle_id" WHERE (vehicles.user_id = 4) LIMIT $1  [["LIMIT", 1]]

    def servicerequest
        @servicerequests = Servicerequest.all
---
SELECT "servicerequests".* FROM "servicerequests"