app/controllers/vehicles_controller.rb

    def insert
        @vehicles=Vehicle.new(vehicle_params)
        respond_to do |format|
            if @vehicles.save
---
INSERT INTO "vehicles" ("vehicle_modal", "service_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["vehicle_modal", "Honda"], ["service_date", "2023-04-28"], ["user_id", 4], ["created_at", "2023-04-20 11:40:46.140763"], ["updated_at", "2023-04-20 11:40:46.140763"]]

    def edit
        @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

    def update
        @vehicle = Vehicle.find(params[:id])

        if @vehicle.update(vehicle_params)
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "vehicles" SET "vehicle_modal" = $1, "updated_at" = $2, "make" = $3, "color" = $4, "licence_number" = $5 WHERE "vehicles"."id" = $6  [["vehicle_modal", "model 1"], ["updated_at", "2023-04-21 10:28:00.434527"], ["make", "brand 1"], ["color", "color 1"], ["licence_number", "number 1"], ["id", 12]]

    def destroy
        @vehicle_has_service = Servicerequest.where(vehicle_id: 3)
        if @vehicle_has_service.blank?
          flash[:alert] = "Vehicle has been booked for service."
          redirect_to '/vehicles/alert'
        else
          @vehicless = Vehicle.find(params[:id])
          @vehicless.destroy
---
SELECT "servicerequests".* FROM "servicerequests" WHERE "servicerequests"."vehicle_id" = $1  [["vehicle_id", 3]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 9]]

      def set_vehicle
        @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]