app/controllers/vehicles_controller.rb

    def show
      if current_user_login.present?
        if current_user_login.customer?
          @currentUser = current_user_login.id
          @vehicles = Vehicle.where(user_id: @currentUser)
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = $1  [["user_id", 4]]

    def create
      if current_user_login.present?
        if current_user_login.customer?
          @vehicles=Vehicle.new(vehicle_params)
          # p @vehicles
          if @vehicles.save
---
INSERT INTO "vehicles" ("vehicle_modal", "service_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["vehicle_modal", ""], ["service_date", nil], ["created_at", "2023-04-19 10:08:22.885145"], ["updated_at", "2023-04-19 10:08:22.885145"]]